app/views/category/_categorycard.erb

SELECT "sites".* FROM "sites" WHERE "sites"."category_id" = ?  [["category_id", 1]]
---
    <div class="ui list selection">
      <% category.sites.all.each_with_index do |site,index| %>