app/controllers/boarding_controller.rb

  def show
    @boardindex = params[:id].to_i
    if @boardindex == 0
      @boardindex = 1
    end
    @board = Board.find(@boardindex)
    @boardtotalnum = Board.count
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "boards"