app/controllers/category_controller.rb

  def update
    @category = Category.find(params[:id])
    @board = @category.board
    if @category.update(params.require(:category).permit(:title))
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "title" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["title", "文具"], ["updated_at", 2016-06-04 15:06:09 UTC], ["id", 1]]