app/controllers/site_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sites" ("title", "url", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "BeSteve"], ["url", "http://www.besteve.net"], ["category_id", 1], ["created_at", 2016-06-04 15:09:55 UTC], ["updated_at", 2016-06-04 15:09:55 UTC]]
---
  def create
    @category = Category.find(params[:category_id])
    @site = @category.sites.create(params.require(:site).permit(:url, :title))

SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "sites".* FROM "sites" WHERE "sites"."category_id" = ?  [["category_id", 1]]
---
  def movesite

    @siteid = params[:site_id]
    @boardingid = params[:boarding_id]
    @categoryid = params[:category_id]
    @directionnext = params[:directionNext]

    @site_from = Site.find(@siteid)
    @site_to
    @category = Category.find(@categoryid)
    @sites_array = @category.sites

    @site_index = @sites_array.find_index(@site_from)